[
    {
        "title": "Event Director – US based",
        "description": "Accountable for managing client relationships, deliverables and expectations. Working closely with the respective Account Directors, you’ll provide leadership on specific projects and support to the team. You’ll work collaboratively with colleagues to provide a seamless, high-quality service and exceptional client experience, whilst ensuring events are profitable and identifying future business opportunities. You’ll also be responsible for coordinating/leading the different teams and services on specific projects and events, to ensure flawless delivery and optimized communications internally and with clients and suppliers. This is a hands-on role and you’ll be involved in the day-to-day management of projects and delivery teams."
    },
    {
        "title": "Producer – US based",
        "description": "You’ll be responsible for the development and on-site delivery of all aspects of the event - including (but not limited to) show design and content, theming, decoration, layout of spaces – within budgets and to clients’ requirements. This is a very hands-on role and you’ll be involved in the day-to-day operation of specific projects at a detailed level."
    },
    {
        "title": "Production Co-ordinator – US based",
        "description": "You’ll be responsible for providing a full range of administrative support to the production team to achieve the smooth running of events and the office. You'll work collaboratively across teams and provide a customer-focused service."
    },
    {
        "title": "Registration Manager – UK based",
        "description": "Accountable for the service standards, process, and delivery oversight of all attendee registration operations within the Event Services Team. From client brief to post-event reporting, you'll provide a seamless, high-quality service and memorable client experience, and ensure all legal, regulatory and health and safety requirements are met. This is a very hands-on role and you’ll be involved in the day-to-day operation of event registrations and platform management."
    },
    {
        "title": "Registration Manager – US based",
        "description": "Accountable for the service standards, process, and delivery oversight of all attendee registration operations within the Event Services Team. From client brief to post-event reporting, you'll provide a seamless, high-quality service and memorable client experience, and ensure all legal, regulatory and health and safety requirements are met. This is a very hands-on role and you’ll be involved in the day-to-day operation of event registrations and platform management."
    },
    {
        "title": "Senior Producer – US based",
        "description": "You’ll be responsible for the development and delivery of all aspects of a project – live event or otherwise – with a focus on content. This is a hands-on role and you’ll be involved in the day-to-day management of projects and delivery teams."
    },
    {
        "title": "(Senior) Strategist – UK based",
        "description": "As an integral member of the strategy team at Nteractive, you’ll be responsible for leading the Strategy and Insight function for specific projects and clients according to agency offering and under the direction of the Head of Strategy. \n You’ ll work closely with the Head of Strategy to embed the Strategy and Insight function across the agency, helping evolve the business and teams through the next steps of the agency’ s natural growth and development."
    },
    {
        "title": "Senior Technical Production Manager – UK based",
        "description": "As Senior Production Manager (Technical Director), you’ll take a leading role in providing clients with exceptional technical production consultancy and services for both live events and exhibitions. The role will require client contact, project delivery and delegation to employees and freelance teams to ensure that the brief of a project is completed and met at all levels. This is a hands-on role and you’ll be involved in the day-to-day technical management of projects and delivery teams."
    },
    {
        "title": "Senior Technical Production Manager – US based",
        "description": "As Senior Production Manager (Technical Director), you’ll take a leading role in providing clients with exceptional technical production consultancy and services for both live events and exhibitions. The role will require client contact, project delivery and delegation to employees and freelance teams to ensure that the brief of a project is completed and met at all levels. This is a hands-on role and you’ll be involved in the day-to-day technical management of projects and delivery teams."
    },
    {
        "title": "Sponsorship Experiences – UK & US based",
        "description": "Responsible for delivering exceptional sponsor/ exhibitor experiences across a variety of events and mediums.  Working collaboratively with the client, vendors, and colleagues to provide seamless event delivery and a cycle of continuous engagement for the sponsors. Supporting the development of strategic relationships with sponsor accounts to achieve long term, high value relationships.  Partner with the sales team, the client and the sponsors to understand both sponsor and client objectives and business needs."
    },
    {
        "title": "Technology Director – UK based",
        "description": "As Nteractive Technology Director, you’ll drive the use of technical solutions to improve collaboration, accuracy and efficiency within the frame of a global live events agency. The role will assist with the deployment of Microsoft365-based technologies, in the implementation and integration of other technologies in the support of the business from time capture, ERP and CRM implementation, through to the use of technology in the direct delivery of live events around the world."
    }
]
