[
    {
        "title": "Project Co-ordinator - UK based",
        "description": "Responsible for providing a full range of administrative support across the business to achieve the smooth running of events and the office. To work collaboratively across teams and provide a customer focused service."
    },
    {
        "title": "Resource & Talent Manager",
        "description": "We have an exciting opportunity for a Resource & Talent Manager to join our team. The individual we seek will be used to working in a fast-paced environment and will look after resource planning, resource forecasting, scheduling & real-time management of all data associated with resourcing across the business. This role has the explicit function of helping to move data management along efficiently and effectively in a proactive manner to ensure we have the infrastructure, tools and process, as well as the talent, to generate growth and support our team and clients."
    },
    {
        "title": "Senior Producer - UK based",
        "description": "Responsible for the development and delivery of all aspects of a project – live event or otherwise – with a focus on content. Take ownership of own assigned projects ensuring flawless delivery from start to finish, ensuring an exceptional client experience every time."
    },
    {
        "title": "Senior Tech Production Manager - US based",
        "description": "A Senior Production Manager (Technical Director) will take a leading role in providing clients with exceptional technical production consultancy and services for both live events and Exhibitions. The role will require client contact, project delivery and delegation to employees and freelance teams to ensure that the brief of a project is completed and met at all levels."
    },
    {
        "title": "Sustainability Manager - UK based",
        "description": "This multifaceted role will lead the mission to position Nteractive as a leader in environmental sustainability within the events industry, with the goal of upholding international environmental standards and best practices. The ESM owns the development, implementation, promotion, and monitoring of environmental strategies and goals across Nteractive. The role coordinates the organization in deploying environmental sustainability actions that lead to the reduction of ecological damage and promote long-term sustainability."
    }
]
