[
    {
        "title": "Food & Beverage Data Co-ordinator – UK based",
        "description": "<p>We have an exciting opportunity for a Food & Beverage Data Co-ordinator to join our Food & Beverage team. To work collaboratively across teams and provide a customer focused service.</p><p>This role will be responsible for providing a full range of data processing and statistical analysis support across the business to allow trend predictions for future years and to contribute to client improvement plans across the company’s business.</p><p>Within this role you will undertake and own all aspects of event/project data to include data gathering, manipulation, analysis, interpretation, and reporting, to provide internal colleagues and clients with meaningful, usable information that allows both Nteractive and clients to make informed, intelligent decisions.</p><p>The role will undertake and own specific areas of project data and budget management on allocated events, providing client consultation and working closely with internal colleagues in the event planning to ensure that the project budgets and data are closely linked to the attendee experiences being created.</p><p>This role would suit someone with experience in data and statistical analysis and management, with good inter-personal skills to develop effective relationships with suppliers, clients, and colleagues. Highly motivated and passionate with a can-do approach to finding solutions and delivering customer service</p>"
    },
    {
        "title": "Food & Beverage Manager – US based",
        "description": "<p>We have a fantastic opportunity for a Food & Beverage Manager to join our Food & Beverage team.</p><p>This role will be responsible for providing the F&B expertise across multiple projects throughout the year within a high-quality events or hospitality environment.</p><p>The role will be responsible for designing memorable culinary experiences through menu and wine selection that are sensitive to both local and dietary needs and within agreed budgets; design and creation of creative F&B presentations, in collaboration with clients, to articulate the vison and culinary journey; responsible for the administrative planning and operational delivery of all aspects of the catering for assigned events.</p><p>Within this role you will lead and be responsible for all F&B within an assigned portfolio of projects ensuring project documentation is kept up to date and accurate, and that agreed parameters and budgets are met; be responsible for the collection of data onsite at each event for future analysis; ensure other team members take ownership of F&B tasks assigned to them as appropriate.</p><p>The ideal candidate will demonstrate leadership, having worked in multifunctional teams and work collaboratively with colleagues, suppliers. Experience of managing on-site teams, providing day to day guidance and support as required. Strong inter-personal skills to develop effective relationships with venue teams, suppliers, clients and colleagues and supplies.</p>"
    },
    {
        "title": "Sustainability Manager - UK based",
        "description": "<p>We have a unique and exciting opportunity for an Environmental Sustainability Manager to join our team and own the development, implementation, promotion, and monitoring of environmental strategies and goals across Nteractive.</p><p>This multifaceted role will lead the mission to position Nteractive as a leader in environmental sustainability within the events industry, with the goal of upholding international environmental standards and best practices. The role coordinates the organization in deploying environmental sustainability actions that lead to the reduction of ecological damage and promote long-term sustainability.</p><p>The ideal candidate will have a minimum of two years working experience as a Sustainability Officer/Manager ideally in an event agency or similar consultancy business. knowledge of sustainability standards, practices, and programs -Experience with ISO certifications, SDGs, Carbon tracking, CDP, ESG; experience in Scope 3 tracking, and Scope 3 engagement programs; experience in change management and continuous quality improvement and experience of working within IS20121.</p>"
    }
]
