[
  {
    "title": "Graphic Designer – UK based",
    "description": "<p>We have an exciting opportunity for a 2D Graphic Designer to join our Creative team.  Working alongside a team of 3D designers, creative leads and creative strategists the Graphic Designer will innovate and deliver strategically aligned, imaginative and unforgettable designs for online and live brand experiences. From concept to delivery, you will work on strategically informed creative concepts, through to refined design executions and artwork (for both digital and live space), the role covers every aspect of the design process. </p><p>As well as live projects, the role will also focus on new business pitches and proposals.  This role will be required to inspire others by demonstrating a love of designing creative solutions and artistic approaches across all brand experience projects, while developing an in depth understanding of Nteractive’s key clients and new potential clients.</p>"
  },
  {
    "title": "Producer (Speaker &amp; Content)",
    "description": "<p>We’re currently recruiting for a Producer who has experience of Speaker & Content management to join our team. We are open to either US based, or UK applicants and the role will be accountable for the development and delivery of all aspects of the presentation of an event with a specific focus and experience of speaker and content management. This includes the setting up all speaker documents via our content management system and project managing speaker requirements from start to finish.</p><p>This role will also be involved in (but not limited to) managing other production workstreams within projects - within budgets and to clients’ requirements. They will maintain a holistic, balanced view and control across all elements of the delivery of the companies’ events, working collaboratively with colleagues, suppliers and clients to provide a creatively inspired, seamlessly delivered, exceptional client experience.</p><p>The ideal candidate will have:</p><ul><li>Proven hands-on experience in a similar Producer role delivering events to deadlines and budget.</li><li>Previous experience managing speakers and content.</li><li>Experience with Rainfocus (Content management platform) is desirable but not essential</li><li>A track record of delivering high quality customer focused services</li><li>Sound knowledge of event design including different types of visuals, staging and venue design</li><li>Good financial and business acumen with experience of basic budget and contract management</li><li>Strong inter-personal skills and the ability to develop effective relationships with suppliers, clients and colleagues</li><li>Ability to manage and develop relationships with clients, partners and stakeholders</li></ul><p>For full details please get in touch with us at careers@nteractive.com or click the Apply button to send us your CV</p>"
  },
  {
    "title": "Project Manager – UK based",
    "description": "<p>We have a fantastic opportunity for a Project Manager to join our team working on lifestyle and technology events for multiple clients.   The Project Manager will be accountable for the delivery of the event or a workstream within a larger event, from client brief to post event to agreed standards and budgets.  They will provide support to the team and work collaboratively with colleagues to provide a seamless, high-quality service and memorable client experience. </p><p>Primary responsibilities will include: </p><ul><li>Work collaboratively with Account Director/Project Director and others to understand the event objectives, internal and external resource requirements, production, logistical and venue requirements and translate these into a detailed project plan and timeline</li><li>Own and lead the project management for assigned events or workstream(s) within a larger event as directed, ensuring correct project documentation is up to date and accurate, agreed parameters and budgets are met and that staff take ownership of tasks assigned to them</li><li>Champion the Nteractive Project Management Framework and other company processes to ensure efficiency, consistency and compliance</li><li>Build effective relationships with clients and suppliers to promote Nteractive as experts in attendee experiences</li><li>Develop timely and accurate budgets to ensure effective financial delivery of the event, proactively manage budgets, identifying issues and addressing these early with colleagues or clients, as appropriate, with the aim of delivering outstanding value for money for the client</li><li>Be responsible for ensuring that everything is delivered to plan on-site, providing direction and guidance to Nteractive and suppliers and creatively problem solving as issues arise</li><li>Seek to continuously improve events and efficiency of the team through analysis of data gathered during and post show, to allow trend predictions for future years and to deliver a client improvement plan after every event</li><li>Manage small project teams, providing day to day guidance and support as required, sharing knowledge and experience to develop their skills and demonstrate the Nteractive values at all times</li></ul><p>The ideal candidate should have the following experience: </p><ul><li>Excellent project management skills, ideally within an agency environment, delivering projects to deadlines and budget</li><li>Experience and desire to work within creative teams and life style brands</li><li>A track record of delivering high quality customer focused services</li><li>Good financial and business acumen with experience of contract management </li><li>Proven Excel skills at intermediate to advanced level and sound ICT skills in general</li></ul><p>And should exude the following competencies:</p><ul><li>Good inter-personal skills to develop effective relationships with suppliers, clients and colleagues</li><li>Ability to manage others working on individual projects</li><li>Ability to work collaboratively and respect the views of others</li><li>Highly motivated and passionate with a can-do approach to finding solutions and delivering customer service</li><li>Good, persuasive communicator both written and verbally</li><li>Highly organised with good attention to detail </li><li>Ability to work at pace and under pressure</li></ul><p>For full details please get in touch with us at careers@nteractive.com or click the Apply button and send us your CV and cover email outlining why you are right for this role.</p>"
  },
  {
    "title": "Senior 3D Designer - UK based",
    "description": "<p>As we continue to grow and develop, we have an exciting opportunity for a Senior 3D Designer to join our Creative team.</p><p>Working alongside a team of 2D designers, creative leads and creative strategists the Senior 3D Designer you will be responsible for translating the overarching event objectives and creative direction into tangible experiences for physical spaces. This can be anything from immersive experiences, exhibition stands, stage sets, experiential activations - anywhere that the live event meets the physical form. Working closely with a multi-disciplined creative team, you will be involved across the lifecycle on a range of highly creative events for some of the world’s biggest brands.</p>"
  }
]
