[
    {
        "title": "Project Co-ordinator - UK based",
        "description": "<p>We have a fantastic opportunity for a Project Co-ordinator to join our production team and learn from our highly skilled team about all aspects of event production.</p><p>This role will be responsible for providing a full range of administrative support and will work collaboratively across different teams and provide a customer focused service.</p><p>Within the role you will be responsible for undertaking event research into all production elements (e.g. entertainment, décor, furniture), undertaking and owning specific areas of the  management of an event, such as production schedules and show running orders; managing production crew logistics, ensuring freelance staff are contracted in time for each specific event, make sure all paperwork is appropriately completed and filed and arranging all crew travel and hotel logistics as required. As well as many other aspects that help to create an event.</p><p>The ideal candidate will have good inter-personal skills the ability to work collaboratively and respect the views of others; be highly motivated and passionate with a can-do approach to finding solutions and delivering customer service; be a clear communicator both written and verbally; highly organised with good attention to detail with some prior experience and involvement in small event delivery and an interest in creative event production, entertainment and technology.</p>"
    },
    {
        "title": "Resource & Talent Manager - UK based",
        "description": "<p>We have an exciting opportunity for a <strong>Resource & Talent Manager</strong> to join our team. The individual we seek will be used to working in a fast-paced environment and will look after resource planning, resource forecasting, scheduling & real-time management of all data associated with resourcing across the business.</p><p>This role has the explicit function of helping to move data management along efficiently and effectively in a proactive manner to ensure we have the infrastructure, tools and process, as well as the talent, to generate growth and support our team and clients.</p><p>The role will ensure that the agency is planning effectively, unlocking the potential across the departments and regions. The role will also ensure we are evaluating our performance against these plans, staying within our agreed financial boundaries and maximising efficiencies and value.</p><p>The role will also provide clear and transparent reporting with insights and forecasts, with the aim of instilling confidence in the global leadership team through in-depth understanding of the business. The role will be working hand in hand with the Client Services team and the Heads of Departments (HoDs).</p><p>This role would suit someone with Experience working in an agency environment, prior experience of resource management and excellent people management skills across all levels of a business.</p>"
    },
    {
        "title": "Senior Producer - UK based",
        "description": "<p>We’re recruiting for an experienced Senior Producer to join our Production team. The role will have responsibility for the development and delivery of all aspects of a project – live event or otherwise – with a focus on content.</p><p>We are looking for someone who has demonstratable confidence in designing content and event agendas; a track record of delivering high quality customer focused services; sound knowledge of event design including different types of visuals, staging, venue design; Experience working in a range of disciplines including video production and digital media.</p><p>The Senior Producer will take ownership of assigned projects ensuring flawless delivery from start to finish, ensuring an exceptional client experience event, supporting the Executive Producer or other colleagues in the design and delivery of larger more complex projects, as well as developing production briefs, leading on content design, researching, sourcing and managing creative solutions and managing all live aspects of the events.</p><p>This is a fantastic opportunity for someone looking to further develop their career as a Producer and work on some exciting large scale projects.</p>"
    },
    {
        "title": "Senior Project Manager (Expo) - UK based",
        "description": "<p>We have a fantastic opportunity for a <strong>Senior Project Manager</strong> to join our team who will be responsible for delivering exceptional sponsor/exhibitor experiences across a variety of events and mediums. Working collaboratively with the client, vendors, and colleagues to provide seamless event delivery and a cycle of continuous engagement for the sponsors.</p><p>This role will partner with the client and the sponsors to understand both sponsor and client objectives and business needs. Be responsible for coordinating/leading the different teams and suppliers on specific events and exhibitions, to ensure flawless delivery and maximised communications internally, with clients and suppliers.</p><p>Contributing to the achievement and exceeding of client revenue targets through the delivery of world class account service and seamless end-to-end orchestration.</p><p>The ideal candidate must have significant experience of working in sponsorship/ exhibition execution at a high level or relevant transferable skills - ideally within an events / exhibition agency. Experience of working in overall event project management/logistics is desirable. Proven project management skills at a senior level, running multiple projects to deadlines and budget. Strong financial and business acumen with experience of contract management.</p>"
    },
    {
        "title": "Senior Tech Production Manager - US based",
        "description": "A Senior Production Manager (Technical Director) will take a leading role in providing clients with exceptional technical production consultancy and services for both live events and Exhibitions. The role will require client contact, project delivery and delegation to employees and freelance teams to ensure that the brief of a project is completed and met at all levels."
    },
    {
        "title": "Sustainability Manager - UK based",
        "description": "<p>We have a unique and exciting opportunity for an Environmental Sustainability Manager to join our team and own the development, implementation, promotion, and monitoring of environmental strategies and goals across Nteractive.</p><p>This multifaceted role will lead the mission to position Nteractive as a leader in environmental sustainability within the events industry, with the goal of upholding international environmental standards and best practices. The role coordinates the organization in deploying environmental sustainability actions that lead to the reduction of ecological damage and promote long-term sustainability.</p><p>The ideal candidate will have a minimum of two years working experience as a Sustainability Officer/Manager ideally in an event agency or similar consultancy business. knowledge of sustainability standards, practices, and programs -Experience with ISO certifications, SDGs, Carbon tracking, CDP, ESG; experience in Scope 3 tracking, and Scope 3 engagement programs; experience in change management and continuous quality improvement and experience of working within IS20121.</p>"
    }
]
