[
  
  {
    "title": "Executive Producer - UK based",
    "description": "<p>We have an exciting opportunity for a UK based Executive Producer to join our highly talented and creative Production team. The Executive Producer will be accountable for the development and delivery of all aspects of the presentation of an event - from (but not limited to) communication strategy through show content, media design, decoration and layout of the rooms - within budgets and to clients’ requirements.  They will provide strategic, commercial and creative input in to the bidding, winning and delivery of projects and maintain a holistic, balanced view and control across all elements of the delivery of events, mentoring other team members to ensure high quality of delivery.</p><p>The Executive Producer will also be responsible for providing leadership and support to the team and works collaboratively with colleagues, suppliers and clients to provide a creatively inspired, seamlessly delivered, exceptional client experience.  Ensuring all legal, regulatory and health and safety requirements are met.</p>"
  },
  {
    "title": "Executive Producer - US based",
    "description": "<p>We have an exciting opportunity for a US based Executive Producer to join our highly talented and creative Production team. The Executive Producer will be accountable for the development and delivery of all aspects of the presentation of an event - from (but not limited to) communication strategy through show content, media design, decoration and layout of the rooms - within budgets and to clients’ requirements.  They will provide strategic, commercial and creative input in to the bidding, winning and delivery of projects and maintain a holistic, balanced view and control across all elements of the delivery of events, mentoring other team members to ensure high quality of delivery. </p><p>The Executive Producer will also be responsible for providing leadership and support to the team and works collaboratively with colleagues, suppliers and clients to provide a creatively inspired, seamlessly delivered, exceptional client experience.  Ensuring all legal, regulatory and health and safety requirements are met.</p>"
  },
  
  {
    "title": "Graphic Designer – UK based",
    "description": "<p>We have an exciting opportunity for a 2D Graphic Designer to join our Creative team.  Working alongside a team of 3D designers, creative leads and creative strategists the Graphic Designer will innovate and deliver strategically aligned, imaginative and unforgettable designs for online and live brand experiences. From concept to delivery, you will work on strategically informed creative concepts, through to refined design executions and artwork (for both digital and live space), the role covers every aspect of the design process. </p><p>As well as live projects, the role will also focus on new business pitches and proposals.  This role will be required to inspire others by demonstrating a love of designing creative solutions and artistic approaches across all brand experience projects, while developing an in depth understanding of Nteractive’s key clients and new potential clients.</p>"
  },
  {
    "title": "Project Co-ordinator – US based",
    "description": "<p>We have a fantastic opportunity for a Project Co-Ordinator to join our Production team in the US and learn about all aspects of event production. This role will be responsible for providing a full range of administrative support as well as undertake research into production elements for events, working on schedules and show running orders, managing crew logistics, liaising with suppliers and freelancers. They will work collaboratively across different teams and provide a customer focused service. </p><p>This role would suit a highly motivated and passionate individual who has a can-do approach and is looking to take that next step in developing a career in the events industry. The role will require the ability to work from home and will also come with extensive travel opportunities both in Europe and the USA.</p>"
  },
  {
    "title": "Project Director",
    "description": "<p>We have a fantastic opportunity for a US based Project Director to join our team. The Project Director will be accountable for managing client relationships, deliverables, and expectations on a project basis.</p><p>They will work closely with respective Account Directors to provide strong leadership and support to teams on specific projects. Work collaboratively with colleagues to provide a seamless, high-quality service, maximised communications, and exceptional client experience, whilst ensuring events are profitable. Ensure all legal, regulatory, information security and health and safety requirements are met.</p><p>This role is a remote working position, and the appointed candidate will be required to travel across US and Europe to attend events.</p>"
  },
  {
    "title": "Senior 3D Designer - UK based",
    "description": "<p>As we continue to grow and develop, we have an exciting opportunity for a Senior 3D Designer to join our Creative team.</p><p>Working alongside a team of 2D designers, creative leads and creative strategists the Senior 3D Designer you will be responsible for translating the overarching event objectives and creative direction into tangible experiences for physical spaces. This can be anything from immersive experiences, exhibition stands, stage sets, experiential activations - anywhere that the live event meets the physical form. Working closely with a multi-disciplined creative team, you will be involved across the lifecycle on a range of highly creative events for some of the world’s biggest brands.</p>"
  },
  
]


