[
  {
    "title": "Executive Producer - US based",
    "description": "<p>We have an exciting opportunity for a US based Executive Producer to join our highly talented and creative Production team. The Executive Producer will be accountable for the development and delivery of all aspects of the presentation of an event - from (but not limited to) communication strategy through show content, media design, decoration and layout of the rooms - within budgets and to clients’ requirements.  They will provide strategic, commercial and creative input in to the bidding, winning and delivery of projects and maintain a holistic, balanced view and control across all elements of the delivery of events, mentoring other team members to ensure high quality of delivery. </p><p>The Executive Producer will also be responsible for providing leadership and support to the team and works collaboratively with colleagues, suppliers and clients to provide a creatively inspired, seamlessly delivered, exceptional client experience.  Ensuring all legal, regulatory and health and safety requirements are met.</p>"
  },
  {
    "title": "Graphic Designer – UK based",
    "description": "<p>We have an exciting opportunity for a 2D Graphic Designer to join our Creative team.  Working alongside a team of 3D designers, creative leads and creative strategists the Graphic Designer will innovate and deliver strategically aligned, imaginative and unforgettable designs for online and live brand experiences. From concept to delivery, you will work on strategically informed creative concepts, through to refined design executions and artwork (for both digital and live space), the role covers every aspect of the design process. </p><p>As well as live projects, the role will also focus on new business pitches and proposals.  This role will be required to inspire others by demonstrating a love of designing creative solutions and artistic approaches across all brand experience projects, while developing an in depth understanding of Nteractive’s key clients and new potential clients.</p>"
  },
  {
    "title": "Producer (Speaker &amp; Content)",
    "description": "<p>We’re currently recruiting for a Producer who has experience of Speaker & Content management to join our team. We are open to either US based, or UK applicants and the role will be accountable for the development and delivery of all aspects of the presentation of an event with a specific focus and experience of speaker and content management. This includes the setting up all speaker documents via our content management system and project managing speaker requirements from start to finish.</p><p>This role will also be involved in (but not limited to) managing other production workstreams within projects - within budgets and to clients’ requirements. They will maintain a holistic, balanced view and control across all elements of the delivery of the companies’ events, working collaboratively with colleagues, suppliers and clients to provide a creatively inspired, seamlessly delivered, exceptional client experience.</p><p>The ideal candidate will have:</p><ul><li>Proven hands-on experience in a similar Producer role delivering events to deadlines and budget.</li><li>Previous experience managing speakers and content.</li><li>Experience with Rainfocus (Content management platform) is desirable but not essential</li><li>A track record of delivering high quality customer focused services</li><li>Sound knowledge of event design including different types of visuals, staging and venue design</li><li>Good financial and business acumen with experience of basic budget and contract management</li><li>Strong inter-personal skills and the ability to develop effective relationships with suppliers, clients and colleagues</li><li>Ability to manage and develop relationships with clients, partners and stakeholders</li></ul><p>For full details please get in touch with us at careers@nteractive.com or click the Apply button to send us your CV</p>"
  },
  {
    "title": "Senior 3D Designer - UK based",
    "description": "<p>As we continue to grow and develop, we have an exciting opportunity for a Senior 3D Designer to join our Creative team.</p><p>Working alongside a team of 2D designers, creative leads and creative strategists the Senior 3D Designer you will be responsible for translating the overarching event objectives and creative direction into tangible experiences for physical spaces. This can be anything from immersive experiences, exhibition stands, stage sets, experiential activations - anywhere that the live event meets the physical form. Working closely with a multi-disciplined creative team, you will be involved across the lifecycle on a range of highly creative events for some of the world’s biggest brands.</p>"
  },
  {
    "title": "Senior Production Manager – UK based",
    "description": "<p>We have a fantastic opportunity for a UK- based Senior Production Manager to join our Team. The Senior Production Manager will take a leading role in providing clients with exceptional technical production consultancy and services for both live events and exhibitions.</p><p>They will work closely with event producers, designers, and other staff to identify solutions to client scope and leverage and expand our technical production offerings. Work collaboratively with Head of Technical Production to devise short- and long-term plans for the Production Team.</p><p>The ideal candidate will have significant proven experience at a management level of producing and delivering multiple large-scale events to deadlines and budget. They will have sound knowledge of event and content strategy integrated across the design process including different types of media, show visuals, staging, venue & environmental design. Have a broad network of suppliers and crew to call upon and comprehensive knowledge of other aspects of production.</p><p>This role is a hybrid working position mixing office and remote working2, and the appointed candidate will be required to travel across Europe and US to attend events.</p>"
  },
  {
    "title": "Senior Production Manager – US based",
    "description": "<p>We have a fantastic opportunity for a US - based Senior Production Manager to join our Team. The Senior Production Manager will take a leading role in providing clients with exceptional technical production consultancy and services for both live events and exhibitions.</p><p>This role will work closely with event producers, designers, and other staff to identify solutions to client scope and leverage and expand our technical production offerings. Working collaboratively with Head of Technical Production to devise short- and long-term plans for the Production Team.</p><p>The ideal candidate will have significant proven experience at a management level of producing and delivering multiple large-scale events to deadlines and budget. They will have sound knowledge of event and content strategy integrated across the design process including different types of media, show visuals, staging, venue & environmental design. Have a broad network of suppliers and crew to call upon and comprehensive knowledge of other aspects of production.</p><p>This role is a remote working position, and the appointed candidate will be required to travel across US and Europe to attend events.</p>"
  }
]

